
[
        {
            "id":"EasyNetworks",
            "title":"EasyNetworks",
            "main_Image" : "main_image1.png",
            "whychoice":["웹 개발 기술 역량을 증진시키기 위해 학습과 연습이 중요합니다. 그중에서도 제일 중요한 것은 경험을 쌓는 것이라고 생각합니다. 다른 개발자가 어떻게 디자인을 하였고 전체적으로 마크업을 어떻게 진행했는지를 경험하면서 더 많은 것을 배울 수 있습니다.","특히 EasyNetworks의 코딩 프로젝트를 선택한 이유는 이미 한번 리뉴얼된 사이트라 최신 트렌드를 파악할 수 있다고 생각했습니다. 이 프로젝트를 통해 현재의 웹 개발 트렌드와 기술을 파악하고 적용할 수 있었으며, 더 나아가 프로젝트를 완성하면서 실질적인 웹 개발 경험을 얻을 수 있었습니다."],
            "Trouble":{
                "trcontents1":["Height 초기 설정","전체적인 스크롤 뷰에서 초기 설정 값을 100vh로 설정해 두어서 스크롤 함에 따라 애니메이션이 나오기 때문에 200vh로 늘려 원활한 화면이 나오도록 설정 "],
                "trcontents2":["슬라이드 플러그인 고정값","이미지를 영역을 못 잡아서 이탈 flex로 임의의 영역을 주고 position으로 값을 주어 위치를 고정 "],
                "trcontents3":["전체적인 마크업 문제점 발생","처음 마크업 작업 할 때 부분적인 마크업들을 생각지 못하고 설정하여 나중에 CSS작업 도중에 막히는 부분이 발생 후에 다시 영역을 분석하고 마크업 하여 정상적으로 코딩 "]
            },
            "Experience":["HTML의 markup 중요도를 알게 됨","JavaScript는 생각보다 더 많은 생각을 하게 만들어준 언어","제작 및 트러블들을 찾아서 해결하는 그런 과정들을 통해 부족한 부분들을 체크해 볼 수 있는 기회가 됨"],
            "Technology":["HTML.png","CSS.png","JS.png","github.png"],
            "Detail":[
                " ㈜이지네트웍스는 전문적인 종합렌탈 서비스를 제공하는 이지렌탈 사업부와공간별 맞춤형 공기정화기와 필터 등의 공기질 관리 제품을 개발, 생산하는 에코버 사업부가 있습니다.지속가능한 사회적 가치 창출과 고객과의 신뢰 관계 발전을 추구합니다.",
                {
                    "content":[" https://kos1234567890.github.io/Person_projecet1/"," Website"," 1개월"," 반응형웹"],
                    "content_img":["easyproduction1.png","easyproduction2.png"]
                }
            ]
        },
        {
            "id":"SeJong",
            "title":"SeJong",
            "main_Image" : "main_image2.png",
            "whychoice":["이전 프로젝트에서는 코딩되어 있는 홈페이지를 보면서 만드는 프로젝트였습니다. 이제 더 발전된 프로젝트를 진행하기 위해 조별로 리뉴얼 사이트를 만들어보았습니다. 그렇게 해서 고른 사이트는 세종문화회관이 었습니다. 이 사이트를 선택한 이유는 단조롭고 답답한 구조의 컨텐츠 배치로 사용자의 편의성이 높지 않아보여 개선 시도를 하였습니다.","기존의 색감은 전체적으로 천(하늘색) 지(황토색) 인(노란색)의 의미를 사용하여 투박한 느낌이 들어서 리뉴얼한 색감에서는 깔끔하고 신비로움을 줄 수 있도록 변경을 시도하였습니다."],
            "Trouble":{
                "trcontents1":["GitHub의 주소 설정","데이터 셋을 가져올 때 인증키를 사용해 홈페이지 주소를 가져왔습니다. 그리고 Github와 연동하던 중 https://에서 만 연결 가능하다는 오류가 발생하고 데이터 셋은 http:// 에서만 가능하여 충돌이 발생했습니다. 이를 해결하기 위해 데이터를 JSON파일의 형식으로 만들었습니다. "],
                "trcontents2":["Kakao 지도의 문제점","지도 전환 버튼 클릭 시 영역은 잡히지만 정상적으로 Load 되지 않는 문제가 발생하여 버튼 클릭 함수 내부에 Kakao지도를 불러오는 함수를 직접 삽입하였습니다."],
                "trcontents3":["팝업창의 무한 로딩","팝업 창을 만든 폴더에 window.open을 넣어서 팝업이 나오도록 설정 해두었는데 해당 화면이 무한 로딩이 되는 모습을 보여주는 현상이 발생했습니다. 이를 해결하기 위해 팝업창을 열 페이지에 주소를 설정했습니다. "]
            },
            "Experience":["API 및 데이터를 다루는 코딩은 처음이라 힘들었지만 팀원들과 상의하며 해결 해 내는것에 뿌듯함을 느낌","Github를 사용하는데 능숙하지 않아서 여러 불편함이 있었지만 형상관리의 중요성을 깨달음","의사소통을 통해 서로 피드백을 주고받으며 문제해결능력을 키운데 있어 뿌듯함을 느낌"],
            "Technology":["HTML.png","CSS.png","JS.png","FIGMA.png","github.png"],
            "Detail":[
                " 세종문화회관은 서울특별시가 설립한 기관으로 서울의 대표적인 문화예술기관입니다. 1978년 준공, 1999년 재단법인으로 재 탄생하여 한국 공연 문화의 산실이자 서울시공연예술의 허브역할을 다하고 있습니다.",
                {
                    "content":["https://kos1234567890.github.io/SeJongPage/"," Website","1개월","반응형웹"],
                    "content_img":["SeJongPageMain.png","SeJongPage_season.png"]
                }
            ]
        },  
        {
            "id":"OMGfoods",
            "title":"OMGfood",
            "main_Image" : "main_image3.png",
            "whychoice":["배운 React.js를 사용하여 프로젝트를 개발함으로써 프론트엔드 개발기술을 향상시킬 수 있습니다. React를 사용하여 사용자 인터페이스를 구축하고 ,상태를 관리하고 ,다양한 컴포넌트와 API들을 사용할 기회라고 생각했습니다.","특히 개인적으로 요리하는 것에 관심이 있어서 초보자들에게 추천할만한 음식레시피사이트가 있으면 좋을 것 같다고 생각했습니다. 뿐만 아니라 음식레시피 같은 것은 현실적이며 실용적인 어플리케이션이라고 판단했습니다. 지금도 많은 사람들이 요리레시피를 찾고 공유하고 있습니다. 그래서 후에 이프로젝트를 통해서 타 사용자들에게 도움을 줄 수 있다고 생각해서 제작하게 되었습니다."],
            "Trouble":{
                "trcontents1":["무료 API 인증키의 한계","무료 API인증키의 트래픽에 한계. 일부 파일을 JSON파일로 만들어서 따로 분류"],
                "trcontents2":["API데이터의 코드","API의 데이터로 코드를 줌 그래서 위험성이 있지만 코드를 보여주기 위해 dangerouslySetInnerHTML와 같은 코드를 작성해서 해결"],
                "trcontents3":["데이터로딩의 문제점","디테일 페이지 내에서 데이터의 로드가 되지 않은 상태를 보여주어서 조건문으로 데이터가 로드가 되면 보여줄 수 있도록 변경. 보여주지 않을 때는 로딩중이라는 문자를 넣어줌"]
            },
            "Experience":["React.js의 여러가지 Hook들에 대해 알게됨","API인증키의 무료트랙픽에는 한계가 있고, 생각보다 더 빠르게 소모가 된다는 것을 알게 됨","번역이 안되어 있어서 불편하다는 생각을 하게됨"],
            "Technology":["React.png","SASS.png","Figma.png"],
            "Detail":[
                " OMGfood 는 요리 과정과 재료에 대한 지침을 제공하는 문서 또는 정보의 모음입니다. 레시피는 특정 요리를 만들 때 필요한 단계별 지침과 사용해야 하는 재료를 포함하며, 종종 요리 시간, 난이도 및 칼로리 정보와 함께 제공됩니다.",
                {
                    "content":["https://kos1234567890.github.io/omgfood/","App","Period : 1개월","Classification : 반응형App"],
                    "content_img":["omgfoodMain.png","omgfood_detail.png"]
                }
            ]
        },
        {
            "id":"JeJePick",
            "title":"JeJePick",
            "main_Image" : "main_image4.png",
            "whychoice":["사용자의 성향을 파악한 뒤 여행지 추천 목록을 보여주고 사용자가 원하는 여행지를 선택하여 여행 코스까지 만들어 볼 수 있는 앱을 구현을 목표로 합니다.","제주도 여행계획을 세울 때 자신이 좋아할만한 목적지를 찾는데 많은 시간이 소요됩니다. 이러한 배경을 바탕으로 사용자의 여행 성향을 파악 후 여행지를 추천해주면 어떨까? 라는 생각으로 해당 앱을 기획해보았습니다."],
            "Trouble":{
                "trcontents1":["데이터베이스를 다루는 것과 mysql의 사용 이슈","메모장에 순서들을 작성. 로직 구성을 메모하며 정리 후 활용하니 좀 더 쉽게 코드를 짤 수 있었음. "],
                "trcontents2":["찜 하트 기능 이용 시 최적화가 안됨","각 아이템마다 DB에서 정보를 불러와야 했기 때문에 context.js를 활용하여 딱 한 번만 불러오게 설정해서 최적화 시켰음. "],
                "trcontents3":["다른 기능과 연계를 생각하지 않고, 성향 테스트 결과 페이지에 모든 데이터와 로직을 연결","다른 기능과 연계 할 수 있도록 로직을 더 간결하게 수정 후 성향 테스트 결과 페이지에 있던 모든 로직과 데이터를 테스트 로딩 페이지 및 다른 페이지에 분할 함"]
            },
            "Experience":["초반 API 를 가지고 기획을 하는데 원하는 데이터가 없거나 정리가 안 되어있어  많은 문제가 생기고 어려움을 겪음","API를 새로 가공하며 성향 테스트를 팀원들과 협의하며 진행하였고 이 밖에도 전체적으로 팀원들과  진행상황, 트러블이슈 공유를 하고  회의 및 소통의 시간을 가지며 끝내 어플을 완성"," git 사용과 DB 를 활용하면서 이것에 대해 익숙해짐"],
            "Technology":["NEXT.js.png","FIGMA.png","mysql.png","SASS.png","github.png"],
            "Detail":[
                " 팀 프로젝트로 진행한 제주도 사용자 맞춤 여행지 추천 서비스 어플 제제픽입니다. 성향테스트를 통해 제주도 관광지를 추천받고 추천받은 관광지를 토대로 코스를 기획할 수 있는 어플입니다.",
                {
                    "content":["https://jeje-pick.vercel.app/"," App"," 1개월","반응형App"],
                    "content_img":["jejepickmain.png","coursemap.png"]
                }
            ]
        }
]
